{
    "contextId":"6baa3490-69d6-48fc-b5d4-3994e3e8fae0",
    "mindId": "01daayheky5f4e02qvrjptftxv",
    "segments": [
        {
            "id": "dfaa32ec17324613aa34adeed45358bd",
            "originalText": "English literature review can be anywhere from two to three pages to an entire book in length for a separate article is section is usually no more than two to four paragraphs maximum. How many sources should I review the amount of Articles? You review will be heavily determined by how broad or narrow your topic is how in depth you want to explore an issue and perhaps how much consensus or disagreement exists in this area in a standalone review. The number of words reviewed by the anywhere from 5 to 15 and up to 30 or more in a full book of literature review. Whereas a journal article usually has fewer than five sources and does not go into great depth, but often focuses on the most important points here are some tips for creating a stronger literature review always Define your topic and audience before beginning your research. This will help later when deciding which works to ultimately include in the review read as many Journal articles as you can especially those that are in your area of Interest. These will give you an excellent idea of how to structure and order your review focus on more current literature.Especially when it comes to studies and articles using older theories is fine if they are fundamental and provide a stable foundation for work has it changed over the years but more current research will always be highly sought after by researchers and other readers. This might go without saying but researchers should always take ample notes while you're researching the tests using note cards tables and Computing programs like Microsoft Excel will help organize an index information and make it much easier to categorize later. Whatever you do don't simply stack text in the relevant pile without first writing down exactly what in the text makes them relevant for more resources on research writing and publication information as well as a full list of academic editing Services visit word vice.com.",
            "confidence": 0.8820814,
            "duration": 38,
            "recordingId": "ea062061d73f479e98fbd6757659f4e5",
            "spokenBy": "394d6dd0-7dbe-4d77-92c6-2af7f8314329"
        }
    ]
}